#+title: Tests
#+author: Marcus Birkenkrahe
#+subtitle: CSC 100
#+SEQ_TODO: PRACTICE | DONE
#+STARTUP: overview hideblocks indent entitiespretty
#+OPTIONS: toc:1 num:1 ^:nil
#+PROPERTY: :header-args:C:      :main yes :includes <stdio.h> :results output :exports both
#+PROPERTY: :header-args:python: :session *Python* :python python3 :results output :exports both
#+PROPERTY: :header-args:R:      :session *R* :results graphics output file :exports both
#+PROPERTY: :header-args:C++:    :main yes :includes <iostream> :results output :exports both

* Test 5 - printf and scanf

#+begin_quote
- This test has no time limit per attempt.
- Only the first attempt counts towards your grade.
- You can use all and any sources that you wish to answer the
  questions.
- The purpose of the text is not to check your knowledge but to
  re-engage you.
- After the deadline, your questions and answers will be visible so
  that you can check your performance.
- A random subset of all test questions asked during the term will
  form the basis of the [optional] final exam at the end of the term.

*Source:* Check the lectures and practice files on GitHub and the
notebook with the reviews for the content. /This test was created with
the help of generative AI (ChatGPT o3-mini-high model)./

*Caveat:* As several of these questions are coding questions, remember that
this is an untimed, open-book test, and you should make use of all
available tools (e.g. the OneCompiler app) to find the correct answer!

*Note:* All tests were generated from scratch for this particular class,
and have not been tested before. If you find an error, please notify
me! You will get the points and a bonus point if you're correct (and
no penalty if not).
#+end_quote

1. How can you print *6.5%* in C?
   - [X] `printf("6.5%%\n");`
   - [ ] `printf("6.5%\n");`
   - [ ] `printf("6.5%%%%\n");`
   - [ ] `printf("6.5%%%\n");`

2. How can you print *2.7182818285* as *2.71* in C?
   - [X] `printf("%.2f\n", 2.7182818285);`
   - [ ] `printf("%.3f\n", 2.7182818285);`
   - [ ] `printf("%0.2lf\n", 2.7182818285);`
   - [ ] `printf("%.2lf\n", 2.7182818285);`

   #+begin_src C :results output
     #include <stdio.h>

     int main() {
       double num = 2.7182818285;
       printf("%.2f\n", num);
       printf("%.3f\n", num);
       printf("%0.2lf\n", num);
       printf("%.2lf\n", num);
       printf("%.2f\n", (int)(num * 100) / 100.0);
       return 0;
     }
   #+end_src

   #+RESULTS:
   : 2.72
   : 2.718
   : 2.72
   : 2.72
   : 2.71

3. How can you define a permanent constant in C?
   - [X] `const int perm = 1;`
   - [ ] `perm const int = 1;`
   - [ ] `int perm = const 1;`
   - [ ] `constant int perm = 1;`

4. What is *stdin* in C?
   - [X] Standard input stream (e.g., keyboard, touchscreen)
   - [ ] Standard output stream
   - [ ] Standard error stream
   - [ ] A file handling function

5. How would you fetch *100* from the keyboard and store it in *x*?
   - [X] `scanf("%i", &x);`
   - [ ] `scanf("%d", x);`
   - [ ] `scanf("%i", x);`
   - [ ] `get("%d", &x);`

6. What must be supplied when calling *printf*?
   - [X] A format string and any number of values to insert
   - [ ] Only a format string
   - [ ] Only values to insert
   - [ ] A format string followed by exactly one value

7. What does the *m* in the general form `%m.pX` specify?
   - [X] Minimum field width
   - [ ] Precision after the decimal point
   - [ ] Conversion specifier
   - [ ] Maximum number of significant digits

8. How does `%5.3d` format the integer `40`?
   - [X] `●●040`
   - [ ] `040●●`
   - [ ] `040`
   - [ ] `●0040`

   #+begin_src C :results output
     printf("....|....|\n");
     printf("%5.3d",40);
   #+end_src

   #+RESULTS:
   : ....|....|
   :   040

9. What is the purpose of the `%e` format specifier?
   - [X] To display floating-point numbers in scientific notation
   - [ ] To display integers with leading zeroes
   - [ ] To format numbers with a fixed number of decimal places
   - [ ] To convert numbers to hexadecimal

10. What is the key characteristic of `%g` formatting?
    - [X] It chooses between exponential and fixed-point notation based on the number's size
    - [ ] It always displays numbers in scientific notation
    - [ ] It forces a fixed number of decimal places
    - [ ] It displays trailing zeroes even when unnecessary

11. What will the following format specifier produce: `%8i` when applied to `100100`?
    - [X] `   100100`
    - [ ] `100100   `
    - [ ] `100100`
    - [ ] ` 100100`

    #+begin_src C :results output
     printf("....|....|\n");
     printf("%-8i%i",100100,1);
    #+end_src

    #+RESULTS:
    : ....|....|
    : 100100  1

12. What is the default precision (`p`) for the `%d` conversion specifier?
    - [X] `p=1`
    - [ ] `p=0`
    - [ ] `p=3`
    - [ ] `p=5`

13. What does `%10.5i` do when applied to `42`?
    - [X] Pads the number with leading zeros to ensure at least 5 digits and right-aligns within 10 characters
    - [ ] Pads the number with trailing zeros
    - [ ] Left-aligns the number within 10 characters
    - [ ] Adds 5 spaces before the number

    #+begin_src C :results output
     printf("....|....|....|\n");
     printf("%10.5i%i",42,1);
    #+end_src

    #+RESULTS:
    : ....|....|....|
    :      000421

14. What does `printf("%.e\n", 1.);` print?
    - [X] `1e+00`
    - [ ] `1.0e+00`
    - [ ] `1E+00`
    - [ ] `1.00e+00`

    #+begin_src C :results output
      printf("....|....|....|\n");
      printf("%.e\n", 1.);  // 1e+00
    #+end_src

    #+RESULTS:
    : ....|....|....|
    : 1e+00

15. What does `printf("%-8d\n", 123);` do?
    - [X] Prints `123` left-aligned within 8 character spaces
    - [ ] Prints `123` right-aligned within 8 character spaces
    - [ ] Prints `      123`
    - [ ] Prints `00000123`

    #+begin_src C :results output
      printf("....|....|....|\n");
      printf("%-8d%i\n", 123,1); 
    #+end_src

    #+RESULTS:
    : ....|....|....|
    : 123     1

16. What is wrong with the following code?
    #+begin_src C
      printf(%s\n, "Hello");
    #+end_src
    - [X] The format string `%s\n` is not enclosed in double quotes
    - [ ] The `%s` specifier cannot be used with `printf`
    - [ ] The `\n` should be outside the format string
    - [ ] The syntax is correct

17. What is the issue with the following code?
    #+begin_src C
      puts("I am %i years old", 22);
    #+end_src
    - [X] `puts` does not support format specifiers like `%i`
    - [ ] The syntax for `puts` requires a newline character
    - [ ] `puts` cannot be used for printing strings
    - [ ] The `%i` specifier should be replaced with `%d`

18. What is wrong with the following function declaration?
    #+begin_src C
      void main()
      {
        puts("");
      }
    #+end_src
    - [X] The `main` function must return `int`, not `void`
    - [ ] `puts("")` cannot be used inside `main`
    - [ ] The function must take `void` as a parameter
    - [ ] The `main` function must return a `char`

19. What is the error in this `printf` statement?
    #+begin_src C
      printf("I have %c\n", "character.");
    #+end_src
    - [X] A string is provided where a character is expected
    - [ ] The `%c` specifier does not exist
    - [ ] The string should be enclosed in single quotes
    - [ ] The `printf` function does not support `%c`

20. What is wrong with this `printf` statement?
    #+begin_src C
      printf("%i + %i = %i \n", 224);
    #+end_src
    - [X] Only one argument is provided, but three are expected
    - [ ] `%i` cannot be used in `printf`
    - [ ] The format string should not contain `+` or `=`
    - [ ] `printf` does not support multiple integer arguments

21. What does a `scanf` *format string* typically contain?
    - [X] Only conversion specifications
    - [ ] A mix of ordinary characters and conversion specifications
    - [ ] Only ordinary characters
    - [ ] A format specifier followed by a newline character

22. What happens if a `scanf` format specifier does not match the expected input?
    - [X] `scanf` stops reading and aborts
    - [ ] `scanf` ignores the error and continues
    - [ ] `scanf` skips the mismatched input and proceeds
    - [ ] `scanf` replaces the incorrect value with zero

23. Which statement is true for the following code?
    #+begin_src C
      int x, y;
      scanf("%d/%d", &x, &y);
    #+end_src
    - [X] It will fail if the input contains spaces before the `/`
    - [ ] The `%d` specifier cannot be used with `/`
    - [ ] It does not correctly read integer values
    - [ ] The format string must contain spaces around `/`

24. Why does the following `scanf` call cause the program to hang?
    #+begin_src C
      int i;
      scanf("%d\n", &i);
    #+end_src
    - [X] `scanf` waits for another non-whitespace input due to `\n`
    - [ ] `scanf` expects a string instead of an integer
    - [ ] The `\n` forces `scanf` to ignore input
    - [ ] The `\n` causes an immediate segmentation fault

25. What does `scanf` do when reading an integer (`%d` or `%i`)?
    - [X] It searches for a digit or a `+`/`-` sign, then reads until a non-digit is encountered
    - [ ] It reads only the first digit and stops
    - [ ] It reads until a space is found, then stops
    - [ ] It only reads positive numbers

26. What is a common mistake when using `scanf`?
    - [X] Including a comma in the format string when expecting space-separated values
    - [ ] Using `%e` to read a floating-point number
    - [ ] Using `&` before a variable in `scanf`
    - [ ] Omitting `\n` at the end of the format string

27. What is required when using `\` in a `scanf` format string?
    - [X] `\` must be escaped as `\\` in the format string
    - [ ] `\` is ignored by `scanf`, so no escaping is needed
    - [ ] `\` must be replaced with `/` to work in `scanf`
    - [ ] `\` is automatically treated as a regular character in `scanf`

28. This code asks for a floating-point input `x`, for example `1.67`. It compiles and accepts input but prints nothing. What is wrong?

    #+begin_src C
      float x;
      scanf("%f", x);
      printf("Your input was: %.2f", x, "\n");
    #+end_src

    - [X] The `scanf` function requires `&x` as an argument
    - [ ] The `printf` function is wrongly formatted
    - [ ] You cannot have `printf` and `scanf` in the same program
    - [ ] The `scanf` function only accepts integers

29. The code below is supposed to print:

    #+begin_example
    : Speed of light (m/s): c = 299792458
    : Euler number: e = 2.718282
    #+end_example

    But instead, it prints:

    #+begin_example
    : Speed of light (m/s): c = 0.000000
    : Euler number: e = -1610612736
    #+end_example

    Fix the program to get the correct output!

    #+begin_src C
      int c = 299792458;
      float e = 2.718282f;

      printf("Speed of light (m/s): c = %f\n", c);
      printf("Euler number: e = %d\n", e);
    #+end_src

    - [X] Swap the format specifiers in the print statements
    - [ ] Declare `c` as a floating-point number and `e` as an integer
    - [ ] Remove `%f` and `%d` from the print statements
    - [ ] Define `c` and `e` as constants

30. Suppose that we call `scanf` as follows:

    #+begin_src C
      scanf("%d%f%d", &i, &x, &j);
    #+end_src

    If the user enters:

    #+begin_example
    10.3 5 6
    #+end_example

    What will be the values of `i`, `x`, and `j` after the call?
    Assume that `i` and `j` are uninitialized `int` variables, and `x` is an uninitialized `float` variable.

    - [X] `i=10, x=.300000, j=5`
    - [ ] `i=10, x=.3, j=5.`
    - [ ] `i=10, x=5.000000, j=6`
    - [ ] `i=10.3, x=0, j=6`

    #+begin_src bash :results output
      echo "10.3 5 6" > input
      cat input
    #+end_src

    #+RESULTS:
    : 10.3 5 6

    #+begin_src C :cmdline < input :main yes :includes <stdio.h>
      int i,j; float x;
      scanf("%d%f%d", &i, &x, &j);
      printf("%d %f %d", i, x, j);
    #+end_src

    #+RESULTS:
    : 10 0.300000 5

31. Suppose that we call `scanf` as follows:

    #+begin_src C 
      scanf("%f%d%f", &x, &i, &y);
    #+end_src

    If the user enters:

    #+begin_example
    12.3●45.6●789
    #+end_example

    What will be the values of `x`, `i`, and `y` after the call?
    Assume that `x` and `y` are uninitialized `float` variables, and
    `i` is an uninitialized `i` variable. `●` stands for an empty space.

    - [X] `i=10, x=.300000, j=5`
    - [ ] `i=10, x=.3, j=5.`
    - [ ] `i=10, x=5.000000, j=6`
    - [ ] `i=10.3, x=0, j=6`

    #+begin_src bash :results output
      echo "12.3 45.6 789" > input
      cat input
    #+end_src

    #+RESULTS:
    : 12.3 45.6 789

    #+begin_src C :cmdline < input :main yes :includes <stdio.h>
      int i; float x,y;
      scanf("%f%d%f", &x, &i, &y);
      printf("%f %d %f", x, i, y);
    #+end_src

    #+RESULTS:
    : 12.300000 45 0.600000

32. The program should print:

    #+begin_example
    foo is 100, and bar is 200
    #+end_example

    But it won't even compile! What's wrong?

    Tip: there are two things wrong with this program.

    #+begin_src C
      #include <stdio>

      float main(void) {
        int foo = 100, bar;
        printf("foo is %d, and bar is %d\n", foo, bar = 200);
        return 0;
      }
    #+end_src

    - [X] The pre-processor declaration should include the header file `<stdio.h>`
    - [X] The `main()` function should be `int` and not `float`
    - [ ] You cannot assign a value to `bar` inside the `printf()` function
    - [ ] You cannot assign a value to `foo` when declaring the type as `int`

33. The following program statements should print out `300` on a line of its own, but it does not even compile! Two things are wrong with it. What are they?

    #+begin_src C
      int fvoid1=100, fvoid2=200, void;
      printf("%dn", void = fvoid1 + fvoid2);
    #+end_src

    *This question has more than one correct answer.*

    - [X] The keyword `void` is protected; it cannot be a variable
    - [X] There is a `\` missing in the formatter `%dn`
    - [ ] The variables `fvoid1` and `fvoid2` in `printf` are not recognized
    - [ ] The formatter should be `%f` and not `%d`

* Test 10: Arrays

1. What causes undefined behavior in the following code?
   #+begin_src C
     int a[5];
     for (int i = 0; i <= 5; ++i) {
       a[i] = i;
       printf("%d ", a[i]);
     }
   #+end_src
   - [X] The loop goes out of bounds and accesses a[5], which is invalid.
   - [ ] The array is not initialized to zero.
   - [ ] The loop variable should start from 1.
   - [ ] The array should have been declared as a pointer.

2. What is the issue with this array initialization?
   #+begin_src C
     int a[3] = {1, 2, 3, 4};
     printf("%d\n", a[3]);
   #+end_src
   - [X] Too many elements in the initializer and access to an out-of-bounds index.
   - [ ] The array is not dynamically allocated.
   - [ ] The format specifier in printf is incorrect.
   - [ ] The array should be declared as float, not int.

3. Why is this code problematic?
   #+begin_src C
     int a[4];
     printf("%d\n", a[4]);
   #+end_src
   - [X] It prints an uninitialized value which may be garbage.
   - [ ] The array should be declared static.
   - [ ] The printf function cannot be used this way.
   - [ ] The index 4 is valid and prints 0 by default.

4. What's wrong with the following character array?
   #+begin_src C
     char str[] = {'h','e','l','l','o'};
     printf("%s\n", str);
   #+end_src
   - [X] There is no null terminator, so printf may read past the array.
   - [ ] The array should be declared as a string literal.
   - [ ] The characters are not enclosed in double quotes.
   - [ ] The format specifier should be %c.

5. What does this code demonstrate?
   #+begin_src C :main yes :includes <stdio.h>
     int i = -4;
     int a[5] = {0};
     printf("%d\n", a[i]);
   #+end_src

   #+RESULTS:
   : 2

   - [X] Accessing an array with a negative index causes undefined behavior.
   - [ ] Negative indexing is valid if the array is initialized.
   - [ ] The array must be dynamically allocated to use negative indices.
   - [ ] Zero-initialization prevents errors with negative indexing.

6. What is a scalar in C?
   - [X] A variable that holds a single data item like a number or character
   - [ ] An array with only one element
   - [ ] A pointer to an integer
   - [ ] A function that returns a single value

7. Which of the following is *not* an aggregate structure in C?
   - [X] Dictionary
   - [ ] Array
   - [ ] Structure
   - [ ] Multi-dimensional array

8. What do Python dictionaries, R data frames, and Lisp lists all have in common?
   - [X] They are data structures for collections of values
   - [ ] They are used for plotting graphs
   - [ ] They require static typing
   - [ ] They only store numeric data

9. What does this C code do?
   #+begin_src C
     int a[10];
     for (int i = 0; i < 10; i++) a[i] = 0;
   #+end_src
   - [X] Initializes an array of 10 integers to 0
   - [ ] Declares a multi-dimensional array
   - [ ] Prints an array from 1 to 10
   - [ ] Causes stack overflow

10. What happens if you declare an array in C without initializing it?
    - [X] It may contain garbage values
    - [ ] All values are automatically set to 0
    - [ ] Compilation fails
    - [ ] The array cannot be accessed

11. What’s the issue with this code?
    #+begin_src C
      int a[10];
      for (i = 1; i <= 10; i++) a[i] = 0;
    #+end_src
    - [X] It writes to a[10], which is out of bounds
    - [ ] It skips initializing the first element
    - [ ] It causes an infinite loop by never incrementing
    - [ ] The syntax of the for loop is invalid

12. What causes "stack smashing detected" in C?
    - [X] Writing beyond the bounds of an array
    - [ ] Using too much memory in your program
    - [ ] Passing an uninitialized pointer to a function
    - [ ] Using too many nested loops

13. Why does the following code cause strange results?
    #+begin_src C
      while ( i < N ) {
        a[i++] = 0;
        printf("a[%d] = %d\n", i, a[i]);
      }
    #+end_src
    - [X] The print statement accesses a[i] after incrementing i
    - [ ] The while loop does not terminate
    - [ ] a[i] is uninitialized due to scope issues
    - [ ] The loop doesn't modify any data

14. How do you properly copy elements from one array to another?
    - [X] Use a for loop with indexing: for (i = 0; i < N; i++) a[i] = b[i];
    - [ ] Use a while loop with side effects: a[i] = b[i++];
    - [ ] Use memcpy even if the sizes differ
    - [ ] Arrays copy automatically with =a = b=

15. What is the result of missing the null terminator in a char array used as a string?
    - [X] It can print extra garbage characters from memory
    - [ ] It causes the program to crash immediately
    - [ ] It prints nothing
    - [ ] It automatically adds '\n' at the end

16. What is a designated initializer in C99?
    - [X] An initializer that explicitly assigns values to selected indexes
    - [ ] A pointer used to initialize arrays
    - [ ] A loop that initializes values in runtime
    - [ ] A macro for dynamic memory allocation

17. What is the output of the following code?
    #+begin_src C
      int c[] = { [2] = 29, [10] = 7, [14] = 48};
      for (int i=0;i<15;i++) if (c[i]!=0) printf("%d ",c[i]);
    #+end_src
    - [X] 29 7 48
    - [ ] 2 10 14
    - [ ] 0 0 0
    - [ ] 48 29 7

18. How do you declare a 2x2 matrix of floats in C?
    - [X] float m[2][2];
    - [ ] float m[2,2];
    - [ ] float[2][2] m;
    - [ ] matrix<float> m(2,2);

19. What is the correct way to initialize a 2x2 identity matrix using designated initializers?
    - [X] double m[2][2] = { [0][0] = 1.0, [1][1] = 1.0 };
    - [ ] double m[2][2] = { 1.0, 0.0, 0.0, 1.0 };
    - [ ] double m[2][2] = (1.0, 0.0, 0.0, 1.0);
    - [ ] identity_matrix(2);

20. What does the following C code do?
    #+begin_src C
      int a[] = {0, 1, 0, 1};
    #+end_src
    - [X] Declares and initializes an integer array of size 4
    - [ ] Declares a scalar variable and sets it to 0
    - [ ] Causes a compiler error because the array size is missing
    - [ ] Creates a pointer to the list {0, 1, 0, 1}

